{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<pad>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "</s>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<unk>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": {
    "type": "Lowercase"
  },
  "pre_tokenizer": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "post_processor": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<unk>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "vocab": {
      "<s>": 0,
      "<pad>": 1,
      "</s>": 2,
      "<unk>": 3,
      "!": 4,
      "\"": 5,
      "#": 6,
      "$": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "@": 35,
      "A": 36,
      "B": 37,
      "C": 38,
      "D": 39,
      "E": 40,
      "F": 41,
      "G": 42,
      "H": 43,
      "I": 44,
      "J": 45,
      "K": 46,
      "L": 47,
      "M": 48,
      "N": 49,
      "O": 50,
      "P": 51,
      "Q": 52,
      "R": 53,
      "S": 54,
      "T": 55,
      "U": 56,
      "V": 57,
      "W": 58,
      "X": 59,
      "Y": 60,
      "Z": 61,
      "[": 62,
      "\\": 63,
      "]": 64,
      "^": 65,
      "_": 66,
      "`": 67,
      "a": 68,
      "b": 69,
      "c": 70,
      "d": 71,
      "e": 72,
      "f": 73,
      "g": 74,
      "h": 75,
      "i": 76,
      "j": 77,
      "k": 78,
      "l": 79,
      "m": 80,
      "n": 81,
      "o": 82,
      "p": 83,
      "q": 84,
      "r": 85,
      "s": 86,
      "t": 87,
      "u": 88,
      "v": 89,
      "w": 90,
      "x": 91,
      "y": 92,
      "z": 93,
      "{": 94,
      "|": 95,
      "}": 96,
      "~": 97,
      "¡": 98,
      "¢": 99,
      "£": 100,
      "¤": 101,
      "¥": 102,
      "¦": 103,
      "§": 104,
      "¨": 105,
      "©": 106,
      "ª": 107,
      "«": 108,
      "¬": 109,
      "®": 110,
      "¯": 111,
      "°": 112,
      "±": 113,
      "²": 114,
      "³": 115,
      "´": 116,
      "µ": 117,
      "¶": 118,
      "·": 119,
      "¸": 120,
      "¹": 121,
      "º": 122,
      "»": 123,
      "¼": 124,
      "½": 125,
      "¾": 126,
      "¿": 127,
      "À": 128,
      "Á": 129,
      "Â": 130,
      "Ã": 131,
      "Ä": 132,
      "Å": 133,
      "Æ": 134,
      "Ç": 135,
      "È": 136,
      "É": 137,
      "Ê": 138,
      "Ë": 139,
      "Ì": 140,
      "Í": 141,
      "Î": 142,
      "Ï": 143,
      "Ð": 144,
      "Ñ": 145,
      "Ò": 146,
      "Ó": 147,
      "Ô": 148,
      "Õ": 149,
      "Ö": 150,
      "×": 151,
      "Ø": 152,
      "Ù": 153,
      "Ú": 154,
      "Û": 155,
      "Ü": 156,
      "Ý": 157,
      "Þ": 158,
      "ß": 159,
      "à": 160,
      "á": 161,
      "â": 162,
      "ã": 163,
      "ä": 164,
      "å": 165,
      "æ": 166,
      "ç": 167,
      "è": 168,
      "é": 169,
      "ê": 170,
      "ë": 171,
      "ì": 172,
      "í": 173,
      "î": 174,
      "ï": 175,
      "ð": 176,
      "ñ": 177,
      "ò": 178,
      "ó": 179,
      "ô": 180,
      "õ": 181,
      "ö": 182,
      "÷": 183,
      "ø": 184,
      "ù": 185,
      "ú": 186,
      "û": 187,
      "ü": 188,
      "ý": 189,
      "þ": 190,
      "ÿ": 191,
      "Ā": 192,
      "ā": 193,
      "Ă": 194,
      "ă": 195,
      "Ą": 196,
      "ą": 197,
      "Ć": 198,
      "ć": 199,
      "Ĉ": 200,
      "ĉ": 201,
      "Ċ": 202,
      "ċ": 203,
      "Č": 204,
      "č": 205,
      "Ď": 206,
      "ď": 207,
      "Đ": 208,
      "đ": 209,
      "Ē": 210,
      "ē": 211,
      "Ĕ": 212,
      "ĕ": 213,
      "Ė": 214,
      "ė": 215,
      "Ę": 216,
      "ę": 217,
      "Ě": 218,
      "ě": 219,
      "Ĝ": 220,
      "ĝ": 221,
      "Ğ": 222,
      "ğ": 223,
      "Ġ": 224,
      "ġ": 225,
      "Ģ": 226,
      "ģ": 227,
      "Ĥ": 228,
      "ĥ": 229,
      "Ħ": 230,
      "ħ": 231,
      "Ĩ": 232,
      "ĩ": 233,
      "Ī": 234,
      "ī": 235,
      "Ĭ": 236,
      "ĭ": 237,
      "Į": 238,
      "į": 239,
      "İ": 240,
      "ı": 241,
      "Ĳ": 242,
      "ĳ": 243,
      "Ĵ": 244,
      "ĵ": 245,
      "Ķ": 246,
      "ķ": 247,
      "ĸ": 248,
      "Ĺ": 249,
      "ĺ": 250,
      "Ļ": 251,
      "ļ": 252,
      "Ľ": 253,
      "ľ": 254,
      "Ŀ": 255,
      "ŀ": 256,
      "Ł": 257,
      "ł": 258,
      "Ń": 259,
      "in": 260,
      "st": 261,
      ");": 262,
      "re": 263,
      "le": 264,
      "on": 265,
      "te": 266,
      "Ġ=": 267,
      "ut": 268,
      "ge": 269,
      "se": 270,
      "fi": 271,
      "ne": 272,
      "Ġ{": 273,
      "Ġ}": 274,
      "ti": 275,
      "file": 276,
      "rea": 277,
      "er": 278,
      "me": 279,
      "Ġ(": 280,
      "ce": 281,
      "Ġi": 282,
      "get": 283,
      "at": 284,
      "rin": 285,
      "tion": 286,
      "or": 287,
      "()": 288,
      "Ġc": 289,
      "();": 290,
      "new": 291,
      "ur": 292,
      "Ġt": 293,
      "out": 294,
      "al": 295,
      "Ġ\"": 296,
      "de": 297,
      "put": 298,
      "ar": 299,
      "ring": 300,
      "string": 301,
      "Ġ+": 302,
      "(\"": 303,
      "ch": 304,
      "an": 305,
      "ro": 306,
      "Ġe": 307,
      "Ġnew": 308,
      "Ġp": 309,
      "lo": 310,
      "strea": 311,
      "stream": 312,
      "nt": 313,
      "Ġfile": 314,
      "Ġb": 315,
      "Ġin": 316,
      "ri": 317,
      "ul": 318,
      "Ġf": 319,
      "Ġn": 320,
      "Ġs": 321,
      "ption": 322,
      "putstream": 323,
      "Ġif": 324,
      "ss": 325,
      "xce": 326,
      "xception": 327,
      "di": 328,
      "co": 329,
      "read": 330,
      "ame": 331,
      "Ġre": 332,
      "ull": 333,
      "li": 334,
      "con": 335,
      "\");": 336,
      "Ġstring": 337,
      "url": 338,
      "ry": 339,
      "Ġnull": 340,
      "pe": 341,
      "Ġd": 342,
      "ate": 343,
      "th": 344,
      "name": 345,
      "set": 346,
      "Ġout": 347,
      "id": 348,
      "ue": 349,
      "age": 350,
      "uf": 351,
      "mp": 352,
      "ad": 353,
      "wri": 354,
      "to": 355,
      "exception": 356,
      "yte": 357,
      "ct": 358,
      "Ġth": 359,
      "write": 360,
      "ser": 361,
      "atch": 362,
      "());": 363,
      "Ġm": 364,
      "Ġ0": 365,
      "ra": 366,
      "Ġtry": 367,
      "uff": 368,
      "la": 369,
      "));": 370,
      "row": 371,
      "Ġcatch": 372,
      "ta": 373,
      "lose": 374,
      "il": 375,
      "len": 376,
      "close": 377,
      "ty": 378,
      "Ġcon": 379,
      "Ġurl": 380,
      "ub": 381,
      "si": 382,
      "ction": 383,
      "sp": 384,
      "rint": 385,
      "Ġthrow": 386,
      "ap": 387,
      "Ġ!": 388,
      "up": 389,
      "Ġst": 390,
      "inputstream": 391,
      "so": 392,
      "tp": 393,
      "ata": 394,
      "Ġv": 395,
      "outputstream": 396,
      "print": 397,
      "Ġ!=": 398,
      "log": 399,
      "lin": 400,
      "ck": 401,
      "em": 402,
      "is": 403,
      "nel": 404,
      "Ġh": 405,
      "ing": 406,
      "Ġret": 407,
      "chan": 408,
      "))": 409,
      "ment": 410,
      "un": 411,
      "().": 412,
      "urce": 413,
      "urn": 414,
      "\",": 415,
      "as": 416,
      "Ġreturn": 417,
      "channel": 418,
      "reader": 419,
      "inal": 420,
      "ex": 421,
      "red": 422,
      "oexception": 423,
      "ath": 424,
      "Ġw": 425,
      "yst": 426,
      "ter": 427,
      "mess": 428,
      "err": 429,
      "xt": 430,
      "line": 431,
      "())": 432,
      "message": 433,
      "lic": 434,
      "Ġj": 435,
      "int": 436,
      "ve": 437,
      "pen": 438,
      "Ġbyte": 439,
      "par": 440,
      "qu": 441,
      "ystem": 442,
      "nection": 443,
      "Ġbuff": 444,
      "Ġde": 445,
      "byte": 446,
      "pro": 447,
      "ation": 448,
      "os": 449,
      "ttp": 450,
      "ublic": 451,
      "Ġfinal": 452,
      "gest": 453,
      "Ġsystem": 454,
      "pa": 455,
      "Ġpublic": 456,
      "data": 457,
      "leng": 458,
      "digest": 459,
      "Ġint": 460,
      "length": 461,
      "ver": 462,
      "ln": 463,
      "ble": 464,
      "en": 465,
      "path": 466,
      "error": 467,
      "ot": 468,
      "date": 469,
      "bu": 470,
      "source": 471,
      "Ġco": 472,
      "println": 473,
      "fo": 474,
      "[]": 475,
      "ile": 476,
      "do": 477,
      "ered": 478,
      "ze": 479,
      "for": 480,
      "Ġ1": 481,
      "que": 482,
      "um": 483,
      "Ġel": 484,
      "val": 485,
      "Ġelse": 486,
      "Ġlog": 487,
      "per": 488,
      "fa": 489,
      "it": 490,
      "Ġ-": 491,
      "list": 492,
      "Ġo": 493,
      "type": 494,
      "ger": 495,
      "ctor": 496,
      "mo": 497,
      "Ġex": 498,
      "Ġvo": 499,
      "Ġbuffered": 500,
      "buff": 501,
      "Ġfor": 502,
      "Ġ==": 503,
      "ent": 504,
      "lass": 505,
      "Ġwh": 506,
      "Ġvoid": 507,
      "py": 508,
      "Ġthrows": 509,
      "spon": 510,
      "gs": 511,
      "stan": 512,
      "sponse": 513,
      "cu": 514,
      "connection": 515,
      "quest": 516,
      ").": 517,
      "ly": 518,
      "ip": 519,
      "ack": 520,
      "writer": 521,
      "add": 522,
      "us": 523,
      "oo": 524,
      "Ġa": 525,
      "tent": 526,
      "Ġfileoutputstream": 527,
      "code": 528,
      "update": 529,
      "dir": 530,
      "ase": 531,
      "ult": 532,
      "rc": 533,
      "der": 534,
      "\\\"": 535,
      "tr": 536,
      "vi": 537,
      "text": 538,
      "Ġ>": 539,
      "buffer": 540,
      "Ġinputstream": 541,
      "and": 542,
      "el": 543,
      "av": 544,
      "ray": 545,
      "array": 546,
      "Ġwhile": 547,
      "ml": 548,
      "je": 549,
      "Ġr": 550,
      "Ġfileinputstream": 551,
      "es": 552,
      "stance": 553,
      "ctory": 554,
      "tic": 555,
      "Ġto": 556,
      "value": 557,
      "Ġ<": 558,
      "alse": 559,
      "ils": 560,
      "wor": 561,
      "Ġdo": 562,
      "Ġpro": 563,
      "of": 564,
      "tostring": 565,
      "time": 566,
      "ke": 567,
      "\";": 568,
      "ava": 569,
      "Ġmd": 570,
      "(),": 571,
      "ioexception": 572,
      "size": 573,
      "Ġioexception": 574,
      "Ġsta": 575,
      "form": 576,
      "rom": 577,
      "no": 578,
      "class": 579,
      "qual": 580,
      "he": 581,
      "Ġmessage": 582,
      "ject": 583,
      "bytes": 584,
      "instance": 585,
      "pend": 586,
      "Ġ(!": 587,
      "load": 588,
      "ith": 589,
      "mage": 590,
      "append": 591,
      "Ġstatic": 592,
      "Ġhttp": 593,
      "tra": 594,
      "sult": 595,
      "Ġ((": 596,
      "rent": 597,
      "dex": 598,
      "00": 599,
      "ho": 600,
      "Ġ&": 601,
      "Ġds": 602,
      "Ġget": 603,
      "ist": 604,
      "user": 605,
      "temp": 606,
      "Ġdest": 607,
      "Ġz": 608,
      "able": 609,
      "ted": 610,
      "];": 611,
      "unt": 612,
      "==": 613,
      "Ġis": 614,
      "++": 615,
      "loc": 616,
      "request": 617,
      "Ġso": 618,
      "Ġtr": 619,
      "Ġfinally": 620,
      "</": 621,
      "uid": 622,
      "ds": 623,
      "io": 624,
      "ort": 625,
      "reate": 626,
      "quals": 627,
      "trace": 628,
      "lean": 629,
      "Ġg": 630,
      "am": 631,
      "open": 632,
      "xml": 633,
      "copy": 634,
      "content": 635,
      "ed": 636,
      "\"))": 637,
      "com": 638,
      "oolean": 639,
      "tri": 640,
      "dire": 641,
      "filename": 642,
      "tags": 643,
      "Ġse": 644,
      "\")": 645,
      "Ġmessagedigest": 646,
      "ma": 647,
      "Ġfalse": 648,
      "key": 649,
      "index": 650,
      "stack": 651,
      "http": 652,
      "po": 653,
      "Ġread": 654,
      "ash": 655,
      "Ġl": 656,
      "pre": 657,
      "dest": 658,
      "od": 659,
      "cess": 660,
      "state": 661,
      "Ġen": 662,
      "stacktrace": 663,
      "art": 664,
      "word": 665,
      "Ġboolean": 666,
      "response": 667,
      "Ġdata": 668,
      "printstacktrace": 669,
      "..": 670,
      "ig": 671,
      "ong": 672,
      "Ġbufferedreader": 673,
      "Ġdc": 674,
      "lu": 675,
      "Ġconn": 676,
      "info": 677,
      "lement": 678,
      "proper": 679,
      "Ġsource": 680,
      "lient": 681,
      "sc": 682,
      "bject": 683,
      "ator": 684,
      "--": 685,
      "ans": 686,
      "md": 687,
      "directory": 688,
      "equals": 689,
      "Ġ&&": 690,
      "ion": 691,
      "count": 692,
      "getname": 693,
      "sion": 694,
      "Ġsrc": 695,
      "mt": 696,
      "str": 697,
      "ader": 698,
      "arser": 699,
      "((": 700,
      "ssword": 701,
      "\"));": 702,
      "Ġconnection": 703,
      "Ġtrue": 704,
      "gor": 705,
      "ber": 706,
      "Ġjava": 707,
      "outils": 708,
      "ination": 709,
      "create": 710,
      "Ġresponse": 711,
      "><": 712,
      "ntry": 713,
      "lete": 714,
      "riv": 715,
      "sh": 716,
      "Ġnot": 717,
      "Ġresult": 718,
      "getinstance": 719,
      "map": 720,
      "ecu": 721,
      "Ġioutils": 722,
      "tain": 723,
      "getchannel": 724,
      "ecute": 725,
      "¿½": 726,
      "ï¿½": 727,
      "ix": 728,
      "getbytes": 729,
      "Ġthis": 730,
      "rivate": 731,
      "resource": 732,
      "atus": 733,
      "teger": 734,
      "Ġfi": 735,
      "Ġline": 736,
      "next": 737,
      "Ġlogger": 738,
      "Ġch": 739,
      "Ġprivate": 740,
      "num": 741,
      "format": 742,
      "++)": 743,
      "sq": 744,
      "Ġ|": 745,
      "bo": 746,
      "Ġ:": 747,
      "buil": 748,
      "ten": 749,
      "pt": 750,
      "ixel": 751,
      "ists": 752,
      "mparser": 753,
      "sub": 754,
      "Ġcopy": 755,
      "input": 756,
      "men": 757,
      "statement": 758,
      "let": 759,
      "Ġinput": 760,
      "comm": 761,
      "Ġfrom": 762,
      "bug": 763,
      "test": 764,
      "che": 765,
      "src": 766,
      "Ġfilechannel": 767,
      "execute": 768,
      "uri": 769,
      "Ġexception": 770,
      "param": 771,
      "client": 772,
      "ht": 773,
      "property": 774,
      "xlen": 775,
      "ixeldata": 776,
      "meth": 777,
      "uc": 778,
      "fl": 779,
      "Ġ'": 780,
      "ca": 781,
      "ress": 782,
      "Ġpa": 783,
      "lexception": 784,
      "not": 785,
      "und": 786,
      "Ġoutput": 787,
      "et": 788,
      "Ġx": 789,
      "tem": 790,
      "exists": 791,
      "comp": 792,
      "ler": 793,
      "output": 794,
      "rep": 795,
      "fig": 796,
      "contain": 797,
      "base": 798,
      "sto": 799,
      "vice": 800,
      "arget": 801,
      "Ġdcmparser": 802,
      "cument": 803,
      "from": 804,
      "tity": 805,
      "Ġ||": 806,
      "ac": 807,
      "ameter": 808,
      "urrent": 809,
      "Ġbuffer": 810,
      "sert": 811,
      "server": 812,
      "serv": 813,
      "dc": 814,
      "method": 815,
      "sa": 816,
      "getmessage": 817,
      "all": 818,
      "Ġar": 819,
      "Ġzip": 820,
      "Ġstringbuffer": 821,
      "zip": 822,
      "header": 823,
      "trans": 824,
      "table": 825,
      "algor": 826,
      "ure": 827,
      "Ġname": 828,
      "Ġpre": 829,
      "Ġdi": 830,
      "algorith": 831,
      "Ġreader": 832,
      "true": 833,
      "cted": 834,
      "Ġoutputstream": 835,
      ".\");": 836,
      "last": 837,
      "ties": 838,
      "substring": 839,
      "Ġrequest": 840,
      "Ġimage": 841,
      "cod": 842,
      "parse": 843,
      "readline": 844,
      "with": 845,
      "Ġ*": 846,
      "Ġtemp": 847,
      "Ġno": 848,
      "start": 849,
      "qui": 850,
      "Ġval": 851,
      "()));": 852,
      "ff": 853,
      "ab": 854,
      "ner": 855,
      "Ġerror": 856,
      "files": 857,
      "Ġinputstreamreader": 858,
      "====": 859,
      "Ġas": 860,
      "quer": 861,
      "Ġlong": 862,
      "wn": 863,
      "debug": 864,
      "ize": 865,
      "contains": 866,
      "entry": 867,
      "buf": 868,
      "Ġ2": 869,
      "conn": 870,
      "null": 871,
      "query": 872,
      "ken": 873,
      "Ġsb": 874,
      "col": 875,
      "ssion": 876,
      "Ġps": 877,
      "son": 878,
      "Ġlist": 879,
      "number": 880,
      "servlet": 881,
      "Ġpst": 882,
      "ew": 883,
      "image": 884,
      "can": 885,
      "use": 886,
      "Ġfos": 887,
      "status": 888,
      "factory": 889,
      "Ġ>>": 890,
      "ph": 891,
      "this": 892,
      "openstream": 893,
      "ere": 894,
      "Ġdestination": 895,
      "parameter": 896,
      "Ġfilename": 897,
      "db": 898,
      "app": 899,
      "urlconnection": 900,
      "fer": 901,
      "delete": 902,
      "dexception": 903,
      "rol": 904,
      "Ġclass": 905,
      "utils": 906,
      "password": 907,
      "scri": 908,
      "gin": 909,
      "ï¿½ï¿½": 910,
      "Ġdigest": 911,
      "ok": 912,
      "result": 913,
      "context": 914,
      "Ġhash": 915,
      "uccess": 916,
      "##": 917,
      "Ġsq": 918,
      "back": 919,
      "mi": 920,
      "Ġwriter": 921,
      "vent": 922,
      "roup": 923,
      "one": 924,
      "aut": 925,
      "Ġftp": 926,
      "be": 927,
      "ms": 928,
      "den": 929,
      "indexof": 930,
      "ipe": 931,
      "Ġ?": 932,
      "Ġset": 933,
      "hash": 934,
      "service": 935,
      "Ġmo": 936,
      "andler": 937,
      "Ġuser": 938,
      "Ġma": 939,
      "Ġinteger": 940,
      "Ġ+=": 941,
      "action": 942,
      "object": 943,
      "ary": 944,
      "man": 945,
      "builder": 946,
      "ting": 947,
      "arch": 948,
      "attri": 949,
      "Ġpar": 950,
      "conne": 951,
      "),": 952,
      "=\"": 953,
      "difi": 954,
      "util": 955,
      "64": 956,
      "uble": 957,
      "version": 958,
      "attribu": 959,
      "uch": 960,
      "utf": 961,
      "Ġid": 962,
      "mple": 963,
      "final": 964,
      "mexception": 965,
      "Ġ\".": 966,
      "ush": 967,
      "getinputstream": 968,
      "mode": 969,
      "ic": 970,
      "Ġ\"\";": 971,
      "attribute": 972,
      "ha": 973,
      "Ġbase": 974,
      "config": 975,
      "item": 976,
      "commit": 977,
      "Ġvalue": 978,
      "Ġpxlen": 979,
      "dcm": 980,
      "Ġstmt": 981,
      "Ġarray": 982,
      "java": 983,
      "Ġ\"\\": 984,
      "openconnection": 985,
      "char": 986,
      "Ġcontent": 987,
      "executeupdate": 988,
      "Ġbytearray": 989,
      "mat": 990,
      "Ġ\"/": 991,
      "getint": 992,
      "atcher": 993,
      "rec": 994,
      "Ġrun": 995,
      "].": 996,
      "fin": 997,
      "//": 998,
      "flush": 999
    },
    "merges": [
      "i n",
      "s t",
      ") ;",
      "r e",
      "l e",
      "o n",
      "t e",
      "Ġ =",
      "u t",
      "g e",
      "s e",
      "f i",
      "n e",
      "Ġ {",
      "Ġ }",
      "t i",
      "fi le",
      "re a",
      "e r",
      "m e",
      "Ġ (",
      "c e",
      "Ġ i",
      "ge t",
      "a t",
      "r in",
      "ti on",
      "o r",
      "( )",
      "Ġ c",
      "( );",
      "ne w",
      "u r",
      "Ġ t",
      "o ut",
      "a l",
      "Ġ \"",
      "d e",
      "p ut",
      "a r",
      "rin g",
      "st ring",
      "Ġ +",
      "( \"",
      "c h",
      "a n",
      "r o",
      "Ġ e",
      "Ġ new",
      "Ġ p",
      "l o",
      "st rea",
      "strea m",
      "n t",
      "Ġ file",
      "Ġ b",
      "Ġ in",
      "r i",
      "u l",
      "Ġ f",
      "Ġ n",
      "Ġ s",
      "p tion",
      "put stream",
      "Ġi f",
      "s s",
      "x ce",
      "xce ption",
      "d i",
      "c o",
      "rea d",
      "a me",
      "Ġ re",
      "ul l",
      "l i",
      "c on",
      "\" );",
      "Ġ string",
      "ur l",
      "r y",
      "Ġn ull",
      "p e",
      "Ġ d",
      "a te",
      "t h",
      "n ame",
      "se t",
      "Ġ out",
      "i d",
      "u e",
      "a ge",
      "u f",
      "m p",
      "a d",
      "w ri",
      "t o",
      "e xception",
      "y te",
      "c t",
      "Ġt h",
      "wri te",
      "se r",
      "at ch",
      "() );",
      "Ġ m",
      "Ġ 0",
      "r a",
      "Ġt ry",
      "uf f",
      "l a",
      ") );",
      "ro w",
      "Ġc atch",
      "t a",
      "lo se",
      "i l",
      "le n",
      "c lose",
      "t y",
      "Ġc on",
      "Ġ url",
      "u b",
      "s i",
      "c tion",
      "s p",
      "rin t",
      "Ġth row",
      "a p",
      "Ġ !",
      "u p",
      "Ġ st",
      "in putstream",
      "s o",
      "t p",
      "at a",
      "Ġ v",
      "out putstream",
      "p rint",
      "Ġ! =",
      "lo g",
      "l in",
      "c k",
      "e m",
      "i s",
      "ne l",
      "Ġ h",
      "in g",
      "Ġre t",
      "ch an",
      ") )",
      "me nt",
      "u n",
      "() .",
      "ur ce",
      "ur n",
      "\" ,",
      "a s",
      "Ġret urn",
      "chan nel",
      "read er",
      "in al",
      "e x",
      "re d",
      "o exception",
      "at h",
      "Ġ w",
      "y st",
      "te r",
      "me ss",
      "er r",
      "x t",
      "lin e",
      "() )",
      "mess age",
      "li c",
      "Ġ j",
      "in t",
      "v e",
      "pe n",
      "Ġb yte",
      "p ar",
      "q u",
      "yst em",
      "ne ction",
      "Ġb uff",
      "Ġ de",
      "b yte",
      "p ro",
      "a tion",
      "o s",
      "t tp",
      "ub lic",
      "Ġf inal",
      "ge st",
      "Ġs ystem",
      "p a",
      "Ġp ublic",
      "d ata",
      "len g",
      "di gest",
      "Ġin t",
      "leng th",
      "v er",
      "l n",
      "b le",
      "e n",
      "p ath",
      "err or",
      "o t",
      "d ate",
      "b u",
      "so urce",
      "Ġc o",
      "print ln",
      "f o",
      "[ ]",
      "i le",
      "d o",
      "e red",
      "z e",
      "f or",
      "Ġ 1",
      "q ue",
      "u m",
      "Ġe l",
      "v al",
      "Ġel se",
      "Ġ log",
      "p er",
      "f a",
      "i t",
      "Ġ -",
      "li st",
      "Ġ o",
      "ty pe",
      "ge r",
      "ct or",
      "m o",
      "Ġe x",
      "Ġv o",
      "Ġbuff ered",
      "b uff",
      "Ġf or",
      "Ġ= =",
      "e nt",
      "la ss",
      "Ġw h",
      "Ġvo id",
      "p y",
      "Ġthrow s",
      "sp on",
      "g s",
      "st an",
      "spon se",
      "c u",
      "con nection",
      "que st",
      ") .",
      "l y",
      "i p",
      "a ck",
      "write r",
      "ad d",
      "u s",
      "o o",
      "Ġ a",
      "te nt",
      "Ġfile outputstream",
      "co de",
      "up date",
      "di r",
      "a se",
      "ul t",
      "r c",
      "d er",
      "\\ \"",
      "t r",
      "v i",
      "te xt",
      "Ġ >",
      "buff er",
      "Ġin putstream",
      "an d",
      "e l",
      "a v",
      "ra y",
      "ar ray",
      "Ġwh ile",
      "m l",
      "j e",
      "Ġ r",
      "Ġfile inputstream",
      "e s",
      "stan ce",
      "ctor y",
      "ti c",
      "Ġt o",
      "val ue",
      "Ġ <",
      "al se",
      "il s",
      "w or",
      "Ġd o",
      "Ġp ro",
      "o f",
      "to string",
      "ti me",
      "k e",
      "\" ;",
      "av a",
      "Ġm d",
      "() ,",
      "i oexception",
      "si ze",
      "Ġi oexception",
      "Ġst a",
      "for m",
      "ro m",
      "n o",
      "c lass",
      "qu al",
      "h e",
      "Ġ message",
      "je ct",
      "byte s",
      "in stance",
      "pen d",
      "Ġ( !",
      "lo ad",
      "i th",
      "m age",
      "ap pend",
      "Ġsta tic",
      "Ġh ttp",
      "t ra",
      "s ult",
      "Ġ( (",
      "re nt",
      "de x",
      "0 0",
      "h o",
      "Ġ &",
      "Ġd s",
      "Ġ get",
      "i st",
      "u ser",
      "te mp",
      "Ġde st",
      "Ġ z",
      "a ble",
      "te d",
      "] ;",
      "u nt",
      "= =",
      "Ġi s",
      "+ +",
      "lo c",
      "re quest",
      "Ġs o",
      "Ġt r",
      "Ġfinal ly",
      "< /",
      "u id",
      "d s",
      "i o",
      "or t",
      "rea te",
      "qual s",
      "tra ce",
      "le an",
      "Ġ g",
      "a m",
      "o pen",
      "x ml",
      "co py",
      "con tent",
      "e d",
      "\" ))",
      "co m",
      "oo lean",
      "t ri",
      "di re",
      "file name",
      "ta gs",
      "Ġ se",
      "\" )",
      "Ġmessage digest",
      "m a",
      "Ġf alse",
      "ke y",
      "in dex",
      "st ack",
      "h ttp",
      "p o",
      "Ġ read",
      "as h",
      "Ġ l",
      "p re",
      "de st",
      "o d",
      "ce ss",
      "st ate",
      "Ġe n",
      "stack trace",
      "ar t",
      "wor d",
      "Ġb oolean",
      "re sponse",
      "Ġd ata",
      "print stacktrace",
      ". .",
      "i g",
      "on g",
      "Ġbuffered reader",
      "Ġd c",
      "l u",
      "Ġcon n",
      "in fo",
      "le ment",
      "pro per",
      "Ġso urce",
      "li ent",
      "s c",
      "b ject",
      "at or",
      "- -",
      "an s",
      "m d",
      "dire ctory",
      "e quals",
      "Ġ& &",
      "i on",
      "co unt",
      "get name",
      "si on",
      "Ġs rc",
      "m t",
      "st r",
      "ad er",
      "ar ser",
      "( (",
      "ss word",
      "\" ));",
      "Ġcon nection",
      "Ġtr ue",
      "g or",
      "b er",
      "Ġj ava",
      "out ils",
      "in ation",
      "c reate",
      "Ġre sponse",
      "> <",
      "nt ry",
      "le te",
      "ri v",
      "s h",
      "Ġn ot",
      "Ġre sult",
      "get instance",
      "m ap",
      "e cu",
      "Ġi outils",
      "ta in",
      "get channel",
      "ecu te",
      "¿ ½",
      "ï ¿½",
      "i x",
      "get bytes",
      "Ġth is",
      "riv ate",
      "re source",
      "at us",
      "te ger",
      "Ġ fi",
      "Ġ line",
      "ne xt",
      "Ġlog ger",
      "Ġc h",
      "Ġp rivate",
      "n um",
      "form at",
      "++ )",
      "s q",
      "Ġ |",
      "b o",
      "Ġ :",
      "bu il",
      "te n",
      "p t",
      "ix el",
      "ist s",
      "mp arser",
      "s ub",
      "Ġco py",
      "in put",
      "me n",
      "state ment",
      "le t",
      "Ġin put",
      "com m",
      "Ġf rom",
      "bu g",
      "te st",
      "ch e",
      "s rc",
      "Ġfile channel",
      "ex ecute",
      "ur i",
      "Ġe xception",
      "par am",
      "c lient",
      "h t",
      "proper ty",
      "x len",
      "ixel data",
      "me th",
      "u c",
      "f l",
      "Ġ '",
      "c a",
      "re ss",
      "Ġp a",
      "le xception",
      "n ot",
      "un d",
      "Ġout put",
      "e t",
      "Ġ x",
      "te m",
      "ex ists",
      "co mp",
      "le r",
      "out put",
      "re p",
      "fi g",
      "con tain",
      "b ase",
      "st o",
      "vi ce",
      "ar get",
      "Ġdc mparser",
      "cu ment",
      "f rom",
      "ti ty",
      "Ġ| |",
      "a c",
      "ame ter",
      "ur rent",
      "Ġbuff er",
      "ser t",
      "ser ver",
      "ser v",
      "d c",
      "meth od",
      "s a",
      "get message",
      "al l",
      "Ġ ar",
      "Ġz ip",
      "Ġstring buffer",
      "z ip",
      "he ader",
      "tr ans",
      "ta ble",
      "al gor",
      "u re",
      "Ġn ame",
      "Ġp re",
      "Ġ di",
      "algor ith",
      "Ġ reader",
      "tr ue",
      "c ted",
      "Ġout putstream",
      ". \");",
      "la st",
      "ti es",
      "sub string",
      "Ġre quest",
      "Ġi mage",
      "co d",
      "par se",
      "read line",
      "w ith",
      "Ġ *",
      "Ġ temp",
      "Ġn o",
      "st art",
      "qu i",
      "Ġv al",
      "() ));",
      "f f",
      "a b",
      "ne r",
      "Ġ error",
      "file s",
      "Ġinputstream reader",
      "== ==",
      "Ġ as",
      "qu er",
      "Ġl ong",
      "w n",
      "de bug",
      "i ze",
      "contain s",
      "ent ry",
      "b uf",
      "Ġ 2",
      "con n",
      "n ull",
      "quer y",
      "k en",
      "Ġs b",
      "co l",
      "ss ion",
      "Ġp s",
      "s on",
      "Ġ list",
      "num ber",
      "serv let",
      "Ġp st",
      "e w",
      "i mage",
      "c an",
      "u se",
      "Ġf os",
      "st atus",
      "fa ctory",
      "Ġ> >",
      "p h",
      "th is",
      "open stream",
      "e re",
      "Ġdest ination",
      "par ameter",
      "Ġfile name",
      "d b",
      "ap p",
      "url connection",
      "f er",
      "de lete",
      "de xception",
      "ro l",
      "Ġc lass",
      "ut ils",
      "pa ssword",
      "sc ri",
      "g in",
      "ï¿½ ï¿½",
      "Ġ digest",
      "o k",
      "re sult",
      "con text",
      "Ġh ash",
      "uc cess",
      "# #",
      "Ġs q",
      "b ack",
      "m i",
      "Ġ writer",
      "ve nt",
      "ro up",
      "on e",
      "a ut",
      "Ġf tp",
      "b e",
      "m s",
      "de n",
      "index of",
      "i pe",
      "Ġ ?",
      "Ġ set",
      "h ash",
      "ser vice",
      "Ġm o",
      "and ler",
      "Ġ user",
      "Ġm a",
      "Ġin teger",
      "Ġ+ =",
      "a ction",
      "o bject",
      "ar y",
      "m an",
      "buil der",
      "t ing",
      "ar ch",
      "at tri",
      "Ġp ar",
      "con ne",
      ") ,",
      "= \"",
      "di fi",
      "ut il",
      "6 4",
      "ub le",
      "ver sion",
      "attri bu",
      "u ch",
      "ut f",
      "Ġi d",
      "mp le",
      "f inal",
      "me xception",
      "Ġ\" .",
      "us h",
      "get inputstream",
      "mo de",
      "i c",
      "Ġ\" \";",
      "attribu te",
      "h a",
      "Ġb ase",
      "con fig",
      "i tem",
      "comm it",
      "Ġval ue",
      "Ġp xlen",
      "dc m",
      "Ġst mt",
      "Ġ array",
      "j ava",
      "Ġ\" \\",
      "open connection",
      "ch ar",
      "Ġcon tent",
      "execute update",
      "Ġbyte array",
      "m at",
      "Ġ\" /",
      "get int",
      "atch er",
      "re c",
      "Ġr un",
      "] .",
      "f in",
      "/ /",
      "fl ush"
    ]
  }
}